target/test-classes/xml/sws/maintainpayment/TC32644_request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sel="http://selfcare.telco.hsntech.com">
  <soapenv:Header/>
  <soapenv:Body>
    <sel:maintainPaymentRequest>
      <sel:externalSystemID>MOBILEAWARE</sel:externalSystemID>
      <sel:action>ADHOC_PAYMENT</sel:action>
      <sel:accountNumber>$accountNumber$</sel:accountNumber>
      <sel:ongoingPaymentMethod>CARD</sel:ongoingPaymentMethod>
      <sel:amount>10.00</sel:amount>
      <sel:externalReference>MP-13</sel:externalReference>
      <sel:cardDetails>
        <sel:useExistingCard>false</sel:useExistingCard>
        <sel:cardName>Lisa Chapman</sel:cardName>
        <sel:cardNumber>4539791001730106</sel:cardNumber>
        <sel:cardEndDate>$cardEndDate$</sel:cardEndDate>
        <sel:cardType>VI</sel:cardType>
        <sel:cvv>123</sel:cvv>
      </sel:cardDetails>
    </sel:maintainPaymentRequest>
  </soapenv:Body>
</soapenv:Envelope>